# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 2, None, 1]],  # 1-P2/4

   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, [1,3], 1, None, 1]],
   [-1, 1, Conv, [32, [3,1], 1, None, 1]],
   [-5, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, [1,5], 1, None, 1]],
   [-1, 1, Conv, [32, [5,1], 1, None, 1]],
   [[-1, -2, -3, -4, -5, -6,-7], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 7 8 9 10

   [-1, 1, MP, []],  # 8-P3/8  9-P3/9  10
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [ -1, 1, Conv, [64, [ 1,3 ], 1, None ,1] ],
   [ -1, 1, Conv, [64, [ 3,1 ], 1, None, 1 ] ],
   [-5, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, [1, 5], 1, None, 1]],
   [-1, 1, Conv, [64, [5,1], 1, None, 1]],
   [[-1,-2, -3, -4, -5, -6,-7], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 14 16 18 20

   [-1, 1, MP, []],  # 15-P4/16    17-p4/16 19
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-2, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, Conv, [128, [1,3], 1, None, 1]],
   [-1, 1, Conv, [128, [3,1], 1, None, 1]],
   [-5, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, Conv, [128, [1, 5], 1, None, 1]],
   [-1, 1, Conv, [128, [5,1], 1, None, 1]],
   [[-1,-2, -3, -4, -5, -6, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],  # 21  24 27 30

   [-1, 1, MP, []],  # 22-P5/32  25-P5/32 28
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [-2, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, Conv, [256, [1,3], 1, None, 1]],
   [-1, 1, Conv, [256, [3,1], 1, None, 1]],
   [-5, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, Conv, [256, [1, 5], 1, None, 1]],
   [-1, 1, Conv, [256, [5,1], 1, None, 1]],
   [[-1,-2, -3, -4, -5, -6,-7], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1]],  # 28 32 36 40
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1]],
   [-2, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],  # 37  41 45 49

   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [30, 1, Conv, [128, 1, 1, None, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, [1,3], 1, None, 1]],
   [-1, 1, Conv, [64, [3,1], 1, None, 1]],
   [-5, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, [1, 5], 1, None, 1]],
   [-1, 1, Conv, [64, [5,1], 1, None, 1]],
   [[-1, -2, -3, -4, -5, -6,-7], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 47    52  57 62

   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [20, 1, Conv, [64, 1, 1, None, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, [1,3], 1, None, 1]],
   [-1, 1, Conv, [32, [3,1], 1, None, 1]],
   [-5, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, [1, 5], 1, None, 1]],
   [-1, 1, Conv, [32, [5,1], 1, None, 1]],
   [[-1, -2, -3, -4, -5, -6,-7], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 57    63 69 75

   [-1, 1, Conv, [128, 3, 2, None, 1]],
   [[-1, 62], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, [3,1], 1, None, 1]],
   [-1, 1, Conv, [64, [3,1], 1, None, 1]],
   [-4, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, [1, 5], 1, None, 1]],
   [-1, 1, Conv, [64, [5,1], 1, None, 1]],
   [[-1, -2, -3, -4, -5, -6,-7], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 65  72 79 86

   [-1, 1, Conv, [256, 3, 2, None, 1]],
   [[-1, 49], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-2, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, Conv, [128, [1,3], 1, None, 1]],
   [-1, 1, Conv, [128, [3,1], 1, None, 1]],
   [-5, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, Conv, [128, [1,5], 1, None, 1]],
   [-1, 1, Conv, [128, [5,1], 1, None, 1]],
   [[-1, -2, -3, -4, -5, -6,-7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],  # 73  81 89 97

   [75, 1, Conv, [128, 3, 1, None, 1]],
   [86, 1, Conv, [256, 3, 1, None, 1]],
   [97, 1, Conv, [512, 3, 1, None, 1]],

   [[98,99,100], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
